{"config": {"name": "sequential_1", "layers": [{"config": {"bias_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_1", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 12, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "batch_input_shape": [null, 8], "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_2", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "units": 20, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_3", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "units": 50, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_4", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "units": 100, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_5", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "units": 50, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_6", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "units": 20, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_7", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "units": 8, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "dtype": "float32", "name": "dense_8", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "sigmoid", "units": 4, "activity_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.3.0", "class_name": "Sequential"}