{"config": {"layers": [{"class_name": "Dense", "config": {"name": "dense_1", "dtype": "float32", "units": 12, "batch_input_shape": [null, 5], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "dtype": "float32", "units": 20, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_3", "dtype": "float32", "units": 50, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_4", "dtype": "float32", "units": 100, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_5", "dtype": "float32", "units": 50, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_6", "dtype": "float32", "units": 20, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_7", "dtype": "float32", "units": 8, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_8", "dtype": "float32", "units": 4, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "sigmoid"}}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.0"}