{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.3.0", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 5], "trainable": true, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "units": 12, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "units": 20, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "name": "dense_3", "units": 50, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "name": "dense_4", "units": 100, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "name": "dense_5", "units": 50, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "name": "dense_6", "units": 20, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "name": "dense_7", "units": 8, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "use_bias": true, "kernel_regularizer": null, "name": "dense_8", "units": 4, "bias_regularizer": null}}]}}