{"keras_version": "2.3.0", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"activation": "relu", "activity_regularizer": null, "units": 12, "trainable": true, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "batch_input_shape": [null, 5], "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "activity_regularizer": null, "units": 20, "trainable": true, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "activity_regularizer": null, "units": 50, "trainable": true, "name": "dense_3", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "activity_regularizer": null, "units": 100, "trainable": true, "name": "dense_4", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "activity_regularizer": null, "units": 50, "trainable": true, "name": "dense_5", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "activity_regularizer": null, "units": 20, "trainable": true, "name": "dense_6", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "activity_regularizer": null, "units": 8, "trainable": true, "name": "dense_7", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "activity_regularizer": null, "units": 4, "trainable": true, "name": "dense_8", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}