{"keras_version": "2.3.0", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_2", "layers": [{"class_name": "Dense", "config": {"name": "dense_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "use_bias": true, "dtype": "float32", "units": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "use_bias": true, "dtype": "float32", "units": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "use_bias": true, "dtype": "float32", "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_12", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "use_bias": true, "dtype": "float32", "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "use_bias": true, "dtype": "float32", "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "use_bias": true, "dtype": "float32", "units": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "use_bias": true, "dtype": "float32", "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_16", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "use_bias": true, "dtype": "float32", "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}}